app/controllers/students_controller.rb

  def create
    @student = Student.new(post_params(:first_name, :last_name)
    @student.save
    redirect_to student_path(@student)
  end

  def show
    @student = Student.find(params[:id])
  end

  def edit
    @student = Student.find(:params[:id])
  end

  def update
    @student = Student.find(params[:id])
    @student.update(post_params(:first_name, :last_name))
    @student.save
    redirect_to student_path(@student)
  end

  def post_params(*args)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-10-05 13:14:53.374690"], ["updated_at", "2018-10-05 13:14:53.374690"]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]